MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256MC204/mcu.h
#define _RPOR3_RP41R_POSITION                    0x00000008
#define _RPOR3_RP41R_MASK                        0x00003F00
#define _RPOR3_RP41R_LENGTH                      0x00000006

#define _RPOR3_RP40R0_POSITION                   0x00000000
#define _RPOR3_RP40R0_MASK                       0x00000001
#define _RPOR3_RP40R0_LENGTH                     0x00000001

#define _RPOR3_RP40R1_POSITION                   0x00000001
#define _RPOR3_RP40R1_MASK                       0x00000002
#define _RPOR3_RP40R1_LENGTH                     0x00000001

#define _RPOR3_RP40R2_POSITION                   0x00000002
#define _RPOR3_RP40R2_MASK                       0x00000004
#define _RPOR3_RP40R2_LENGTH                     0x00000001

#define _RPOR3_RP40R3_POSITION                   0x00000003
#define _RPOR3_RP40R3_MASK                       0x00000008
#define _RPOR3_RP40R3_LENGTH                     0x00000001

#define _RPOR3_RP40R4_POSITION                   0x00000004
#define _RPOR3_RP40R4_MASK                       0x00000010
#define _RPOR3_RP40R4_LENGTH                     0x00000001

#define _RPOR3_RP40R5_POSITION                   0x00000005
#define _RPOR3_RP40R5_MASK                       0x00000020
#define _RPOR3_RP40R5_LENGTH                     0x00000001

#define _RPOR3_RP41R0_POSITION                   0x00000008
#define _RPOR3_RP41R0_MASK                       0x00000100
#define _RPOR3_RP41R0_LENGTH                     0x00000001

#define _RPOR3_RP41R1_POSITION                   0x00000009
#define _RPOR3_RP41R1_MASK                       0x00000200
#define _RPOR3_RP41R1_LENGTH                     0x00000001

#define _RPOR3_RP41R2_POSITION                   0x0000000A
#define _RPOR3_RP41R2_MASK                       0x00000400
#define _RPOR3_RP41R2_LENGTH                     0x00000001

#define _RPOR3_RP41R3_POSITION                   0x0000000B
#define _RPOR3_RP41R3_MASK                       0x00000800
#define _RPOR3_RP41R3_LENGTH                     0x00000001

#define _RPOR3_RP41R4_POSITION                   0x0000000C
#define _RPOR3_RP41R4_MASK                       0x00001000
#define _RPOR3_RP41R4_LENGTH                     0x00000001

#define _RPOR3_RP41R5_POSITION                   0x0000000D
#define _RPOR3_RP41R5_MASK                       0x00002000
#define _RPOR3_RP41R5_LENGTH                     0x00000001

#define _RPOR4_RP42R_POSITION                    0x00000000
#define _RPOR4_RP42R_MASK                        0x0000003F
#define _RPOR4_RP42R_LENGTH                      0x00000006

#define _RPOR4_RP43R_POSITION                    0x00000008
#define _RPOR4_RP43R_MASK                        0x00003F00
#define _RPOR4_RP43R_LENGTH                      0x00000006

#define _RPOR4_RP42R0_POSITION                   0x00000000
#define _RPOR4_RP42R0_MASK                       0x00000001
#define _RPOR4_RP42R0_LENGTH                     0x00000001

#define _RPOR4_RP42R1_POSITION                   0x00000001
#define _RPOR4_RP42R1_MASK                       0x00000002
#define _RPOR4_RP42R1_LENGTH                     0x00000001

#define _RPOR4_RP42R2_POSITION                   0x00000002
#define _RPOR4_RP42R2_MASK                       0x00000004
#define _RPOR4_RP42R2_LENGTH                     0x00000001

#define _RPOR4_RP42R3_POSITION                   0x00000003
#define _RPOR4_RP42R3_MASK                       0x00000008
#define _RPOR4_RP42R3_LENGTH                     0x00000001

#define _RPOR4_RP42R4_POSITION                   0x00000004
#define _RPOR4_RP42R4_MASK                       0x00000010
#define _RPOR4_RP42R4_LENGTH                     0x00000001

#define _RPOR4_RP42R5_POSITION                   0x00000005
#define _RPOR4_RP42R5_MASK                       0x00000020
#define _RPOR4_RP42R5_LENGTH                     0x00000001

#define _RPOR4_RP43R0_POSITION                   0x00000008
#define _RPOR4_RP43R0_MASK                       0x00000100
#define _RPOR4_RP43R0_LENGTH                     0x00000001

#define _RPOR4_RP43R1_POSITION                   0x00000009
#define _RPOR4_RP43R1_MASK                       0x00000200
#define _RPOR4_RP43R1_LENGTH                     0x00000001

#define _RPOR4_RP43R2_POSITION                   0x0000000A
#define _RPOR4_RP43R2_MASK                       0x00000400
#define _RPOR4_RP43R2_LENGTH                     0x00000001

#define _RPOR4_RP43R3_POSITION                   0x0000000B
#define _RPOR4_RP43R3_MASK                       0x00000800
#define _RPOR4_RP43R3_LENGTH                     0x00000001

#define _RPOR4_RP43R4_POSITION                   0x0000000C
#define _RPOR4_RP43R4_MASK                       0x00001000
#define _RPOR4_RP43R4_LENGTH                     0x00000001

#define _RPOR4_RP43R5_POSITION                   0x0000000D
#define _RPOR4_RP43R5_MASK                       0x00002000
#define _RPOR4_RP43R5_LENGTH                     0x00000001

#define _RPOR5_RP54R_POSITION                    0x00000000
#define _RPOR5_RP54R_MASK                        0x0000003F
#define _RPOR5_RP54R_LENGTH                      0x00000006

#define _RPOR5_RP55R_POSITION                    0x00000008
#define _RPOR5_RP55R_MASK                        0x00003F00
#define _RPOR5_RP55R_LENGTH                      0x00000006

#define _RPOR5_RP54R0_POSITION                   0x00000000
#define _RPOR5_RP54R0_MASK                       0x00000001
#define _RPOR5_RP54R0_LENGTH                     0x00000001

#define _RPOR5_RP54R1_POSITION                   0x00000001
#define _RPOR5_RP54R1_MASK                       0x00000002
#define _RPOR5_RP54R1_LENGTH                     0x00000001

#define _RPOR5_RP54R2_POSITION                   0x00000002
#define _RPOR5_RP54R2_MASK                       0x00000004
#define _RPOR5_RP54R2_LENGTH                     0x00000001

#define _RPOR5_RP54R3_POSITION                   0x00000003
#define _RPOR5_RP54R3_MASK                       0x00000008
#define _RPOR5_RP54R3_LENGTH                     0x00000001

#define _RPOR5_RP54R4_POSITION                   0x00000004
#define _RPOR5_RP54R4_MASK                       0x00000010
#define _RPOR5_RP54R4_LENGTH                     0x00000001

